docs/leets/0049-Group-Anagrams.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<div id="outline-container-orgc6fa423" class="outline-2">
<h2 id="orgc6fa423">49. Group Anagrams</h2>
<div class="outline-text-2" id="text-orgc6fa423">
</div>
</div>
<div id="outline-container-orge2f8e39" class="outline-2">
<h2 id="orge2f8e39">Problem Overview</h2>
<div class="outline-text-2" id="text-orge2f8e39">
<p>
The problem is to group anagrams from a list of strings. Anagrams are words or phrases made by rearranging the letters of another, such as "cinema" and "iceman". 
</p>

<p>
Given an array of strings, you need to group the anagrams together. Each group of anagrams should be represented as an array of strings, and all the groups should be returned together in a single array.
</p>
</div>
</div>

<div id="outline-container-org6a3e476" class="outline-2">
<h2 id="org6a3e476">Solution Outline</h2>
<div class="outline-text-2" id="text-org6a3e476">
<ul class="org-ul">
<li><b><b>Preferred Structure:</b></b> Use a hash map (or object) where the key is a sorted version of the string, and the value is an array of strings (the anagrams).</li>
<li><b><b>Brute Force vs Optimal Solution:</b></b> The brute force method would involve comparing each string with every other string, which is inefficient. The optimal solution sorts each string and uses it as a key in the hash map to group anagrams together.</li>
<li><b><b>Algorithm Choice:</b></b> Sorting each string and using a hash map ensures a time complexity of O(NKlogK), where N is the number of strings and K is the maximum length of a string.</li>
</ul>
</div>
</div>

<div id="outline-container-org6cc7575" class="outline-2">
<h2 id="org6cc7575">Implement the Solution</h2>
<div class="outline-text-2" id="text-org6cc7575">
<div class="org-src-container">
<pre class="src src-js">/**
 * Groups anagrams from a list of strings.
 * @param {string[]} strs - List of strings.
 * @returns {string[][]} - Grouped anagrams.
 */
function groupAnagrams(strs) {
    // Return a dummy result for now
    const h = {};

    function tokey(str) {
        return str.toLowerCase().split('').sort().join('');
    }

    for (let s of strs) {
        const k = tokey(s);
        if (!h[k]) {
            h[k] = [];
        }

        h[k].push(s);
    }

    const res = [];
    for (k in h) {
        res.push(h[k]);
    }

    return res;
}

// Test cases
const testCases = [
    { strs: ["eat", "tea", "tan", "ate", "nat", "bat"], expected: [["eat", "tea", "ate"], ["tan", "nat"], ["bat"]] },
    { strs: [""], expected: [[""]] },
    { strs: ["a"], expected: [["a"]] }
];

testCases.forEach((test, index) =&gt; {
    const result = groupAnagrams(test.strs);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by d)zharii.
</div>
</body>
</html>
